[
  {
    "title": "Welcome to Karta",
    "content": "Welcome to Karta! This is your personal graph-based workspace for organizing files, ideas, projects, and creative work.\n\n**Everything stays on your computer** - Karta runs locally with its own server, so your data is private and secure.\n\nUse the mouse wheel or pinch to **zoom**, and drag with the middle mouse button or two fingers on touchpad to **pan** around the canvas."
  },
  {
    "title": "The Overview",
    "content": "Karta can be thought of as a canvas file browser. It has access to the folders and files inside any vault you create, and turns them into **Nodes**.\n\nYou can move, scale, and connect Nodes together as you see fit. Connected Nodes will always appear together, so you can navigate your files by the associations you define, and not just their location in your file system.\n\nIn addition to files and folders, you can create **Virtual Nodes**. For now this is mostly for text notes, which you can create anywhere to further organise thoughts and ideas."
  },
  {
    "title": "Understanding Contexts",
    "content": "In Karta, you're always viewing the graph from the perspective some node - this is called a **Context**, and that node is called that Context's **Focal Node**. You'll recognise it by its thick bright outline.\n\nEvery node has a Context, which contains all the nodes that are connected to it. The same Nodes can have different arrangements in different Contexts. You can think of it like having the same files in multiple places, but with no duplication.\n\nYou can **Enter** a node's context by right-clicking and selecting \"Enter Context\", which makes that node the new focal point and shows its related nodes."
  },
  {
    "title": "Creating Your First Nodes",
    "content": "Start building your graph by creating Nodes in your current Context:\n\n**Right-click** on empty space to open the context menu and create:\n- **Text Nodes** for notes, ideas, and written content\n- **Generic Nodes** for simple labeled items\n- **Directory Nodes** which create actual folders in that location\n- **File Nodes** create empty files in that location\n\nEach Node's content is unique, but you can display the same Node in multiple Contexts with different visual styles. You can use the search to bring in any Node into the current Context."
  },
  {
    "title": "Connecting Ideas with Edges",
    "content": "**Edges** (the lines between nodes) explicitly connect related ideas.\n\n**Create edges** by:\n1. Selecting one or more Nodes\n2. Dragging from the handle at the bottom\n\nEdges exist in the content layer, so they're visible across all Contexts. Use them to say \"these ideas belong together\"."
  },
  {
    "title": "Next Steps",
    "content": "Those are the basics! Karta is still extremely barebones, but what's there should convey the concept and be somewhat useful. It has been in prototyping and concepting stages for a long time (too long), and now it's time to hear what you think about it!\n\nQuestions, feedback, and feature ideas can all be directed to karta@teodosin.com. All thoughts are greatly appreciated!"
  }
]

